PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sct.h
/****************************************************************************************************
 * arch/arm/src/lpc43xx/chip/lpc43_sct.h
 *
 *   Copyright (C) 2012 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_SCT_H
#define __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_SCT_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/
/* Register Offsets *********************************************************************************/

#define LPC43_SCT_CONFIG_OFFSET     0x0000 /* SCT configuration register */
#define LPC43_SCT_CTRL_OFFSET       0x0004 /* SCT control register */
#define LPC43_SCT_CTRLL_OFFSET      0x0004 /* SCT control register low 16-bit */
#define LPC43_SCT_CTRLH_OFFSET      0x0006 /* SCT control register high 16-bit */
#define LPC43_SCT_LIMIT_OFFSET      0x0008 /* SCT limit register */
#define LPC43_SCT_LIMITL_OFFSET     0x0008 /* SCT limit register low 16-bit */
#define LPC43_SCT_LIMITH_OFFSET     0x000a /* SCT limit register high 16-bit */
#define LPC43_SCT_HALT_OFFSET       0x000c /* SCT halt condition register */
#define LPC43_SCT_HALTL_OFFSET      0x000c /* SCT halt condition register low 16-bit */
#define LPC43_SCT_HALTH_OFFSET      0x000e /* SCT halt condition register high 16-bit */
#define LPC43_SCT_STOP_OFFSET       0x0010 /* SCT stop condition register */
#define LPC43_SCT_STOPL_OFFSET      0x0010 /* SCT stop condition register low 16-bit */
#define LPC43_SCT_STOPH_OFFSET      0x0012 /* SCT stop condition register high 16-bit */
#define LPC43_SCT_START_OFFSET      0x0014 /* SCT start condition register */
#define LPC43_SCT_STARTL_OFFSET     0x0014 /* SCT start condition register low 16-bit */
#define LPC43_SCT_STARTH_OFFSET     0x0016 /* SCT start condition register high 16-bit */

#define LPC43_SCT_COUNT_OFFSET      0x0040 /* SCT counter register */
#define LPC43_SCT_COUNTL_OFFSET     0x0040 /* SCT counter register low 16-bit */
#define LPC43_SCT_COUNTH_OFFSET     0x0042 /* SCT counter register high 16-bit */
#define LPC43_SCT_STATE_OFFSET      0x0044 /* SCT state register */
#define LPC43_SCT_STATEL_OFFSET     0x0044 /* SCT state register low 16-bit */
#define LPC43_SCT_STATEH_OFFSET     0x0046 /* SCT state register high 16-bit */
#define LPC43_SCT_INPUT_OFFSET      0x0048 /* SCT input register */
#define LPC43_SCT_REGM_OFFSET       0x004c /* SCT match/capture registers mode register */
#define LPC43_SCT_REGML_OFFSET      0x004c /* SCT match/capture registers mode register low 16-bit */
#define LPC43_SCT_REGMH_OFFSET      0x004e /* SCT match/capture registers mode register high 16-bit */
#define LPC43_SCT_OUT_OFFSET        0x0050 /* SCT output register */
#define LPC43_SCT_OUTDIRC_OFFSET    0x0054 /* SCT output counter direction control register */
#define LPC43_SCT_RES_OFFSET        0x0058 /* SCT conflict resolution register */
#define LPC43_SCT_DMAREQ0_OFFSET    0x005c /* SCT DMA request 0 register */
#define LPC43_SCT_DMAREQ1_OFFSET    0x0060 /* SCT DMA request 1 register */

#define LPC43_SCT_EVEN_OFFSET       0x00f0 /* SCT event enable register */
#define LPC43_SCT_EVFLAG_OFFSET     0x00f4 /* SCT event flag register */
#define LPC43_SCT_CONEN_OFFSET      0x00f8 /* SCT conflict enable register */
#define LPC43_SCT_CONFLAG_OFFSET    0x00fC /* SCT conflict flag register */

#define LPC43_SCT_MATCH_OFFSET(n)   (0x0100 + ((n) << 4)) /* n = 0..15 */
#define LPC43_SCT_MATCH0_OFFSET     0x0100 /* SCT match value register of match channel 0 */
#define LPC43_SCT_MATCH1_OFFSET     0x0104 /* SCT match value register of match channel 1 */
#define LPC43_SCT_MATCH2_OFFSET     0x0108 /* SCT match value register of match channel 2 */
#define LPC43_SCT_MATCH3_OFFSET     0x010c /* SCT match value register of match channel 3 */
#define LPC43_SCT_MATCH4_OFFSET     0x0110 /* SCT match value register of match channel 4 */
#define LPC43_SCT_MATCH5_OFFSET     0x0114 /* SCT match value register of match channel 5 */
#define LPC43_SCT_MATCH6_OFFSET     0x0118 /* SCT match value register of match channel 6 */
#define LPC43_SCT_MATCH7_OFFSET     0x011c /* SCT match value register of match channel 7 */
#define LPC43_SCT_MATCH8_OFFSET     0x0120 /* SCT match value register of match channel 8 */
#define LPC43_SCT_MATCH9_OFFSET     0x0124 /* SCT match value register of match channel 9 */
#define LPC43_SCT_MATCH10_OFFSET    0x0128 /* SCT match value register of match channel 10 */
#define LPC43_SCT_MATCH11_OFFSET    0x012c /* SCT match value register of match channel 11 */
#define LPC43_SCT_MATCH12_OFFSET    0x0130 /* SCT match value register of match channel 12 */
#define LPC43_SCT_MATCH13_OFFSET    0x0134 /* SCT match value register of match channel 13 */
#define LPC43_SCT_MATCH14_OFFSET    0x0138 /* SCT match value register of match channel 14 */
#define LPC43_SCT_MATCH15_OFFSET    0x013c /* SCT match value register of match channel 15 */

