PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sct.h
#define LPC43_SCT_MATCHRLA_OFFSET(n) (0x0280 + ((n) << 4)) /* n = 0..15 */
#define LPC43_SCT_MATCHR0LA_OFFSET  0x0280 /* SCT match reload alias register of match channel 0; low 16-bit */
#define LPC43_SCT_MATCHR1LA_OFFSET  0x0284 /* SCT match reload alias register of match channel 1; low 16-bit */
#define LPC43_SCT_MATCHR2LA_OFFSET  0x0288 /* SCT match reload alias register of match channel 2; low 16-bit */
#define LPC43_SCT_MATCHR3LA_OFFSET  0x028c /* SCT match reload alias register of match channel 3; low 16-bit */
#define LPC43_SCT_MATCHR4LA_OFFSET  0x0290 /* SCT match reload alias register of match channel 4; low 16-bit */
#define LPC43_SCT_MATCHR5LA_OFFSET  0x0294 /* SCT match reload alias register of match channel 5; low 16-bit */
#define LPC43_SCT_MATCHR6LA_OFFSET  0x0298 /* SCT match reload alias register of match channel 6; low 16-bit */
#define LPC43_SCT_MATCHR7LA_OFFSET  0x029c /* SCT match reload alias register of match channel 7; low 16-bit */
#define LPC43_SCT_MATCHR8LA_OFFSET  0x02a0 /* SCT match reload alias register of match channel 8; low 16-bit */
#define LPC43_SCT_MATCHR9LA_OFFSET  0x02a4 /* SCT match reload alias register of match channel 9; low 16-bit */
#define LPC43_SCT_MATCHR10LA_OFFSET 0x02a8 /* SCT match reload alias register of match channel 10; low 16-bit */
#define LPC43_SCT_MATCHR11LA_OFFSET 0x02ac /* SCT match reload alias register of match channel 11; low 16-bit */
#define LPC43_SCT_MATCHR12LA_OFFSET 0x02b0 /* SCT match reload alias register of match channel 12; low 16-bit */
#define LPC43_SCT_MATCHR13LA_OFFSET 0x02b4 /* SCT match reload alias register of match channel 13; low 16-bit */
#define LPC43_SCT_MATCHR14LA_OFFSET 0x02b8 /* SCT match reload alias register of match channel 14; low 16-bit */
#define LPC43_SCT_MATCHR15LA_OFFSET 0x02bc /* SCT match reload alias register of match channel 15; low 16-bit */

#define LPC43_SCT_MATCHRHA_OFFSET(n) (0x0282 + ((n) << 4)) /* n = 0..15 */
#define LPC43_SCT_MATCHR0HA_OFFSET  0x0282 /* SCT match reload alias register of match channel 0; high 16-bit */
#define LPC43_SCT_MATCHR1HA_OFFSET  0x0286 /* SCT match reload alias register of match channel 1; high 16-bit */
#define LPC43_SCT_MATCHR2HA_OFFSET  0x028a /* SCT match reload alias register of match channel 2; high 16-bit */
#define LPC43_SCT_MATCHR3HA_OFFSET  0x028e /* SCT match reload alias register of match channel 3; high 16-bit */
#define LPC43_SCT_MATCHR4HA_OFFSET  0x0292 /* SCT match reload alias register of match channel 4; high 16-bit */
#define LPC43_SCT_MATCHR5HA_OFFSET  0x0296 /* SCT match reload alias register of match channel 5; high 16-bit */
#define LPC43_SCT_MATCHR6HA_OFFSET  0x029a /* SCT match reload alias register of match channel 6; high 16-bit */
#define LPC43_SCT_MATCHR7HA_OFFSET  0x029e /* SCT match reload alias register of match channel 7; high 16-bit */
#define LPC43_SCT_MATCHR8HA_OFFSET  0x02a2 /* SCT match reload alias register of match channel 8; high 16-bit */
#define LPC43_SCT_MATCHR9HA_OFFSET  0x02a6 /* SCT match reload alias register of match channel 9; high 16-bit */
#define LPC43_SCT_MATCHR10HA_OFFSET 0x02aa /* SCT match reload alias register of match channel 10; high 16-bit */
#define LPC43_SCT_MATCHR11HA_OFFSET 0x02ae /* SCT match reload alias register of match channel 11; high 16-bit */
#define LPC43_SCT_MATCHR12HA_OFFSET 0x02b2 /* SCT match reload alias register of match channel 12; high 16-bit */
#define LPC43_SCT_MATCHR13HA_OFFSET 0x02b6 /* SCT match reload alias register of match channel 13; high 16-bit */
#define LPC43_SCT_MATCHR14HA_OFFSET 0x02ba /* SCT match reload alias register of match channel 14; high 16-bit */
#define LPC43_SCT_MATCHR15HA_OFFSET 0x02be /* SCT match reload alias register of match channel 15; high 16-bit */

#define LPC43_SCT_CAPCA_OFFSET(n)   (0x0280 + ((n) << 4)) /* n = 0..15 */
#define LPC43_SCT_CAPC0A_OFFSET     0x0280 /* SCT capture control alias register Ch0 */
#define LPC43_SCT_CAPC1A_OFFSET     0x0284 /* SCT capture control alias register Ch1 */
#define LPC43_SCT_CAPC2A_OFFSET     0x0288 /* SCT capture control alias register Ch2 */
#define LPC43_SCT_CAPC3A_OFFSET     0x028c /* SCT capture control alias register Ch3 */
#define LPC43_SCT_CAPC4A_OFFSET     0x0290 /* SCT capture control alias register Ch4 */
#define LPC43_SCT_CAPC5A_OFFSET     0x0294 /* SCT capture control alias register Ch5 */
#define LPC43_SCT_CAPC6A_OFFSET     0x0298 /* SCT capture control alias register Ch6 */
#define LPC43_SCT_CAPC7A_OFFSET     0x029c /* SCT capture control alias register Ch7 */
#define LPC43_SCT_CAPC8A_OFFSET     0x02a0 /* SCT capture control alias register Ch8 */
#define LPC43_SCT_CAPC9A_OFFSET     0x02a4 /* SCT capture control alias register Ch9 */
#define LPC43_SCT_CAPC10A_OFFSET    0x02a8 /* SCT capture control alias register Ch10 */
#define LPC43_SCT_CAPC11A_OFFSET    0x02ac /* SCT capture control alias register Ch11 */
#define LPC43_SCT_CAPC12A_OFFSET    0x02b0 /* SCT capture control alias register Ch12 */
#define LPC43_SCT_CAPC13A_OFFSET    0x02b4 /* SCT capture control alias register Ch13 */
#define LPC43_SCT_CAPC14A_OFFSET    0x02b8 /* SCT capture control alias register Ch14 */
#define LPC43_SCT_CAPC15A_OFFSET    0x02bc /* SCT capture control alias register Ch15 */

#define LPC43_SCT_CAPCLA_OFFSET(n)  (0x0280 + ((n) << 4)) /* n = 0..15 */
#define LPC43_SCT_CAPC0LA_OFFSET    0x0280 /* SCT capture control alias register Ch0; low 16-bit */
#define LPC43_SCT_CAPC1LA_OFFSET    0x0284 /* SCT capture control alias register Ch1; low 16-bit */
#define LPC43_SCT_CAPC2LA_OFFSET    0x0288 /* SCT capture control alias register Ch2; low 16-bit */
#define LPC43_SCT_CAPC3LA_OFFSET    0x028c /* SCT capture control alias register Ch3; low 16-bit */
#define LPC43_SCT_CAPC4LA_OFFSET    0x0290 /* SCT capture control alias register Ch4; low 16-bit */
#define LPC43_SCT_CAPC5LA_OFFSET    0x0294 /* SCT capture control alias register Ch5; low 16-bit */
#define LPC43_SCT_CAPC6LA_OFFSET    0x0298 /* SCT capture control alias register Ch6; low 16-bit */
#define LPC43_SCT_CAPC7LA_OFFSET    0x029c /* SCT capture control alias register Ch7; low 16-bit */
#define LPC43_SCT_CAPC8LA_OFFSET    0x02a0 /* SCT capture control alias register Ch8; low 16-bit */
#define LPC43_SCT_CAPC9LA_OFFSET    0x02a4 /* SCT capture control alias register Ch9; low 16-bit */
#define LPC43_SCT_CAPC10LA_OFFSET   0x02a8 /* SCT capture control alias register Ch10; low 16-bit */
#define LPC43_SCT_CAPC11LA_OFFSET   0x02ac /* SCT capture control alias register Ch11; low 16-bit */
#define LPC43_SCT_CAPC12LA_OFFSET   0x02b0 /* SCT capture control alias register Ch12; low 16-bit */
#define LPC43_SCT_CAPC13LA_OFFSET   0x02b4 /* SCT capture control alias register Ch13; low 16-bit */
#define LPC43_SCT_CAPC14LA_OFFSET   0x02b8 /* SCT capture control alias register Ch14; low 16-bit */
#define LPC43_SCT_CAPC15LA_OFFSET   0x02bc /* SCT capture control alias register Ch15; low 16-bit */

#define LPC43_SCT_CAPCHA_OFFSET(n)  (0x0282 + ((n) << 4)) /* n = 0..15 */
#define LPC43_SCT_CAPC0HA_OFFSET    0x0282 /* SCT capture control alias register Ch0; high 16-bit */
#define LPC43_SCT_CAPC1HA_OFFSET    0x0286 /* SCT capture control alias register Ch1; high 16-bit */
#define LPC43_SCT_CAPC2HA_OFFSET    0x028a /* SCT capture control alias register Ch2; high 16-bit */
#define LPC43_SCT_CAPC3HA_OFFSET    0x028e /* SCT capture control alias register Ch3; high 16-bit */
#define LPC43_SCT_CAPC4HA_OFFSET    0x0292 /* SCT capture control alias register Ch4; high 16-bit */
#define LPC43_SCT_CAPC5HA_OFFSET    0x0296 /* SCT capture control alias register Ch5; high 16-bit */
#define LPC43_SCT_CAPC6HA_OFFSET    0x029a /* SCT capture control alias register Ch6; high 16-bit */
#define LPC43_SCT_CAPC7HA_OFFSET    0x029e /* SCT capture control alias register Ch7; high 16-bit */
#define LPC43_SCT_CAPC8HA_OFFSET    0x02a2 /* SCT capture control alias register Ch8; high 16-bit */
#define LPC43_SCT_CAPC9HA_OFFSET    0x02a6 /* SCT capture control alias register Ch9; high 16-bit */
#define LPC43_SCT_CAPC10HA_OFFSET   0x02aa /* SCT capture control alias register Ch10; high 16-bit */
#define LPC43_SCT_CAPC11HA_OFFSET   0x02ae /* SCT capture control alias register Ch11; high 16-bit */
#define LPC43_SCT_CAPC12HA_OFFSET   0x02b2 /* SCT capture control alias register Ch12; high 16-bit */
#define LPC43_SCT_CAPC13HA_OFFSET   0x02b6 /* SCT capture control alias register Ch13; high 16-bit */
#define LPC43_SCT_CAPC14HA_OFFSET   0x02ba /* SCT capture control alias register Ch14; high 16-bit */
#define LPC43_SCT_CAPC15HA_OFFSET   0x02be /* SCT capture control alias register Ch15; high 16-bit */

#define LPC43_SCT_EVSM_OFFSET(n)    (0x0300 + ((n) << 3))
#define LPC43_SCT_EVC_OFFSET(n)     (0x0304 + ((n) << 3))

#define LPC43_SCT_EVSM0_OFFSET      0x0300 /* SCT event state register 0 */
#define LPC43_SCT_EVC0_OFFSET       0x0304 /* SCT event control register 0 */
#define LPC43_SCT_EVSM1_OFFSET      0x0308 /* SCT event state register 1 */
#define LPC43_SCT_EVC1_OFFSET       0x030c /* SCT event control register 1 */
#define LPC43_SCT_EVSM2_OFFSET      0x0310 /* SCT event state register 2 */
#define LPC43_SCT_EVC2_OFFSET       0x0314 /* SCT event control register 2 */
#define LPC43_SCT_EVSM3_OFFSET      0x0318 /* SCT event state register 3 */
#define LPC43_SCT_EVC3_OFFSET       0x031c /* SCT event control register 3 */
#define LPC43_SCT_EVSM4_OFFSET      0x0320 /* SCT event state register 4 */
#define LPC43_SCT_EVC4_OFFSET       0x0324 /* SCT event control register 4 */
#define LPC43_SCT_EVSM5_OFFSET      0x0328 /* SCT event state register 5 */
#define LPC43_SCT_EVC5_OFFSET       0x032c /* SCT event control register 5 */
#define LPC43_SCT_EVSM6_OFFSET      0x0330 /* SCT event state register 6 */
#define LPC43_SCT_EVC6_OFFSET       0x0334 /* SCT event control register 6 */
#define LPC43_SCT_EVSM7_OFFSET      0x0338 /* SCT event state register 7 */
#define LPC43_SCT_EVC7_OFFSET       0x033c /* SCT event control register 7 */
#define LPC43_SCT_EVSM8_OFFSET      0x0340 /* SCT event state register 8 */
#define LPC43_SCT_EVC8_OFFSET       0x0344 /* SCT event control register 8 */
#define LPC43_SCT_EVSM9_OFFSET      0x0348 /* SCT event state register 9 */
#define LPC43_SCT_EVC9_OFFSET       0x034c /* SCT event control register 9 */
#define LPC43_SCT_EVSM10_OFFSET     0x0350 /* SCT event state register 10 */
#define LPC43_SCT_EVC10_OFFSET      0x0354 /* SCT event control register 10 */
#define LPC43_SCT_EVSM11_OFFSET     0x0358 /* SCT event state register 11 */
#define LPC43_SCT_EVC11_OFFSET      0x035c /* SCT event control register 11 */
#define LPC43_SCT_EVSM12_OFFSET     0x0360 /* SCT event state register 12 */
#define LPC43_SCT_EVC12_OFFSET      0x0364 /* SCT event control register 12 */
#define LPC43_SCT_EVSM13_OFFSET     0x0368 /* SCT event state register 13 */
#define LPC43_SCT_EVC13_OFFSET      0x036c /* SCT event control register 13 */
#define LPC43_SCT_EVSM14_OFFSET     0x0370 /* SCT event state register 14 */
#define LPC43_SCT_EVC14_OFFSET      0x0374 /* SCT event control register 14 */
#define LPC43_SCT_EVSM15_OFFSET     0x0378 /* SCT event state register 15 */
#define LPC43_SCT_EVC15_OFFSET      0x037c /* SCT event control register 15 */

#define LPC43_SCT_OUTSET_OFFSET(n)  (0x0500 + ((n) << 3))
#define LPC43_SCT_OUTCLR_OFFSET(n)  (0x0504 + ((n) << 3))

#define LPC43_SCT_OUTSET0_OFFSET    0x0500 /* SCT output 0 set register */
#define LPC43_SCT_OUTCLR0_OFFSET    0x0504 /* SCT output 0 clear register */
#define LPC43_SCT_OUTSET1_OFFSET    0x0508 /* SCT output 1 set register */
#define LPC43_SCT_OUTCLR1_OFFSET    0x050c /* SCT output 1 clear register */
#define LPC43_SCT_OUTSET2_OFFSET    0x0510 /* SCT output 2 set register */
#define LPC43_SCT_OUTCLR2_OFFSET    0x0514 /* SCT output 2 clear register */
#define LPC43_SCT_OUTSET3_OFFSET    0x0518 /* SCT output 3 set register */
#define LPC43_SCT_OUTCLR3_OFFSET    0x051c /* SCT output 3 clear register */
#define LPC43_SCT_OUTSET4_OFFSET    0x0520 /* SCT output 4 set register */
#define LPC43_SCT_OUTCLR4_OFFSET    0x0524 /* SCT output 4 clear register */
#define LPC43_SCT_OUTSET5_OFFSET    0x0528 /* SCT output 5 set register */
#define LPC43_SCT_OUTCLR5_OFFSET    0x052c /* SCT output 5 clear register */
#define LPC43_SCT_OUTSET6_OFFSET    0x0530 /* SCT output 6 set register */
#define LPC43_SCT_OUTCLR6_OFFSET    0x0534 /* SCT output 6 clear register */
#define LPC43_SCT_OUTSET7_OFFSET    0x0538 /* SCT output 7 set register */
#define LPC43_SCT_OUTCLR7_OFFSET    0x053c /* SCT output 7 clear register */
#define LPC43_SCT_OUTSET8_OFFSET    0x0540 /* SCT output 8 set register */
#define LPC43_SCT_OUTCLR8_OFFSET    0x0544 /* SCT output 8 clear register */
#define LPC43_SCT_OUTSET9_OFFSET    0x0548 /* SCT output 9 set register */
#define LPC43_SCT_OUTCLR9_OFFSET    0x054c /* SCT output 9 clear register */
#define LPC43_SCT_OUTSET10_OFFSET   0x0550 /* SCT output 10 set register */
#define LPC43_SCT_OUTCLR10_OFFSET   0x0554 /* SCT output 10 clear register */
#define LPC43_SCT_OUTSET11_OFFSET   0x0558 /* SCT output 11 set register */
#define LPC43_SCT_OUTCLR11_OFFSET   0x055c /* SCT output 11 clear register */
#define LPC43_SCT_OUTSET12_OFFSET   0x0560 /* SCT output 12 set register */
#define LPC43_SCT_OUTCLR12_OFFSET   0x0564 /* SCT output 12 clear register */
#define LPC43_SCT_OUTSET13_OFFSET   0x0568 /* SCT output 13 set register */
#define LPC43_SCT_OUTCLR13_OFFSET   0x056c /* SCT output 13 clear register */
#define LPC43_SCT_OUTSET14_OFFSET   0x0570 /* SCT output 14 set register */
#define LPC43_SCT_OUTCLR14_OFFSET   0x0574 /* SCT output 14 clear register */
#define LPC43_SCT_OUTSET15_OFFSET   0x0578 /* SCT output 15 set register */
#define LPC43_SCT_OUTCLR15_OFFSET   0x057c /* SCT output 15 clear register */

/* Register Addresses *******************************************************************************/

#define LPC43_SCT_CONFIG            (LPC43_SCT_BASE+LPC43_SCT_CONFIG_OFFSET)
#define LPC43_SCT_CTRL              (LPC43_SCT_BASE+LPC43_SCT_CTRL_OFFSET)
#define LPC43_SCT_CTRLL             (LPC43_SCT_BASE+LPC43_SCT_CTRLL_OFFSET)
#define LPC43_SCT_CTRLH             (LPC43_SCT_BASE+LPC43_SCT_CTRLH_OFFSET)
#define LPC43_SCT_LIMIT             (LPC43_SCT_BASE+LPC43_SCT_LIMIT_OFFSET)
#define LPC43_SCT_LIMITL            (LPC43_SCT_BASE+LPC43_SCT_LIMITL_OFFSET)
#define LPC43_SCT_LIMITH            (LPC43_SCT_BASE+LPC43_SCT_LIMITH_OFFSET)
#define LPC43_SCT_HALT              (LPC43_SCT_BASE+LPC43_SCT_HALT_OFFSET)
#define LPC43_SCT_HALTL             (LPC43_SCT_BASE+LPC43_SCT_HALTL_OFFSET)
#define LPC43_SCT_HALTH             (LPC43_SCT_BASE+LPC43_SCT_HALTH_OFFSET)
#define LPC43_SCT_STOP              (LPC43_SCT_BASE+LPC43_SCT_STOP_OFFSET)
#define LPC43_SCT_STOPL             (LPC43_SCT_BASE+LPC43_SCT_STOPL_OFFSET)
#define LPC43_SCT_STOPH             (LPC43_SCT_BASE+LPC43_SCT_STOPH_OFFSET)
#define LPC43_SCT_START             (LPC43_SCT_BASE+LPC43_SCT_START_OFFSET)
#define LPC43_SCT_STARTL            (LPC43_SCT_BASE+LPC43_SCT_STARTL_OFFSET)
#define LPC43_SCT_STARTH            (LPC43_SCT_BASE+LPC43_SCT_STARTH_OFFSET)

