PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sct.h
#define SCT_CTRL_DOWNU              (1 << 0)  /* Bit 0:  Unified counter counts down */
#define SCT_CTRL_STOPU              (1 << 1)  /* Bit 1:  Unified counter stopped (I/O events can occur) */
#define SCT_CTRL_HALTU              (1 << 2)  /* Bit 2:  Unified counter halted (no events can occur) */
#define SCT_CTRL_CLRCTRU            (1 << 3)  /* Bit 3:  Clear unified counter */
#define SCT_CTRL_BIDIRU             (1 << 4)  /* Bit 4:  Unified counter direction select */
#define SCT_CTRL_PREU_SHIFT         (5)       /* Bits 5-12: Unified counter SCT clock prescale factor */
#define SCT_CTRL_PREU_MASK          (0xff << SCT_CTRL_PREU_SHIFT)

#define SCT_CTRL_DOWNL              (1 << 0)  /* Bit 0:  L counter counts down */
#define SCT_CTRL_STOPL              (1 << 1)  /* Bit 1:  L counter stopped (I/O events can occur) */
#define SCT_CTRL_HALTL              (1 << 2)  /* Bit 2:  L counter halted (no events can occur) */
#define SCT_CTRL_CLRCTRL            (1 << 3)  /* Bit 3:  Clear L counter */
#define SCT_CTRL_BIDIRL             (1 << 4)  /* Bit 4:  L counter direction select */
#define SCT_CTRL_PREL_SHIFT         (5)       /* Bits 5-12: L counter SCT clock prescale factor */
#define SCT_CTRL_PREL_MASK          (0xff << SCT_CTRL_PREL_SHIFT)
                                              /* Bits 13-15: Reserved */
#define SCT_CTRL_DOWNH              (1 << 16) /* Bit 16: H counter counts down */
#define SCT_CTRL_STOPH              (1 << 17) /* Bit 17: H counter stopped (I/O events can occur) */
#define SCT_CTRL_HALTH              (1 << 18) /* Bit 18: H counter halted (no events can occur) */
#define SCT_CTRL_CLRCTRH            (1 << 19) /* Bit 19: Clear H counter */
#define SCT_CTRL_BIDIRH             (1 << 20) /* Bit 20: H counter direction select */
#define SCT_CTRL_PREH_SHIFT         (21)      /* Bits 21-28: H counter SCT clock prescale factor */
#define SCT_CTRL_PREH_MASK          (0xff << yy)
                                                /* Bits 29-31: Reserved */
/* SCT control register low/high 16-bit */

#define SCT_CTRL_DOWN               (1 << 0)  /* Bit 0:  Unified counter counts down */
#define SCT_CTRL_STOP               (1 << 1)  /* Bit 1:  Unified counter stopped (I/O events can occur) */
#define SCT_CTRL_HALT               (1 << 2)  /* Bit 2:  Unified counter halted (no events can occur) */
#define SCT_CTRL_CLRCTR             (1 << 3)  /* Bit 3:  Clear unified counter */
#define SCT_CTRL_BIDIR              (1 << 4)  /* Bit 4:  Unified counter direction select */
#define SCT_CTRL_PRE_SHIFT          (5)       /* Bits 5-12: Unified counter SCT clock prescale factor */
#define SCT_CTRL_PRE_MASK           (0xff << SCT_CTRL_PRE_SHIFT)
                                              /* Bits 13-16: Reserved */
/* SCT limit register (all 32-bits for unified counter) */

#define SCT_LIMITL_SHIFT            (0)       /* Bits 0-15: Limit for L counter */
#define SCT_LIMITL_MASK             (0xffff << SCT_LIMITL_SHIFT)
#define SCT_LIMITH_SHIFT            (16)      /* Bits 16-31: Limit for H counter */
#define SCT_LIMITH_MASK             (0xffff << SCT_LIMITH_SHIFT)

/* SCT limit register low/high 16-bit (all 16-bits for limit value) */

/* SCT halt condition register (all 32-bits for unified counter) */

#define SCT_HALTU(n)                (1 << (n))
#define SCT_HALTL_SHIFT             (0)       /* Bits 0-15: Set HALTL in CTRL register */
#define SCT_HALTL_MASK              (0xffff << SCT_HALTL_SHIFT)
#  define SCT_HALTL(n)              (1 << (n))
#define SCT_HALTH_SHIFT             (16)      /* Bits 16-31:Set HALTL in CTRL register */
#define SCT_HALTH_MASK              (0xffff << SCT_HALTH_SHIFT)
#  define SCT_HALTH(n)              (1 << (SCT_HALTH_SHIFT+(n)))

/* SCT halt condition register low/high 16-bit (all 16-bits for halt condition) */

#define SCT_HALT(n)                 (1 << (n))

/* SCT stop condition register (all 32-bits for unified counter) */

#define SCT_STOPU(n)                (1 << (n))
#define SCT_STOPL_SHIFT             (0)       /* Bits 0-15: Set STOPL in CTRL register */
#define SCT_STOPL_MASK              (0xffff << SCT_STOPL_SHIFT)
#  define SCT_STOPL(n)              (1 << (n))
#define SCT_STOPH_SHIFT             (16)      /* Bits 16-31:Set STOPL in CTRL register */
#define SCT_STOPH_MASK              (0xffff << SCT_STOPH_SHIFT)
#  define SCT_STOPH(n)              (1 << (SCT_STOPH_SHIFT+(n)))

/* SCT stop condition register low 16-bit (all 16-bits for stop condition) */

#define SCT_STOP(n)                 (1 << (n))

/* SCT start condition register (all 32-bits for unified counter) */

#define SCT_STARTU(n)               (1 << (n))
#define SCT_STARTL_SHIFT            (0)       /* Bits 0-15: Clear STOPL in CTRL register */
#define SCT_STARTL_MASK             (0xffff << SCT_STARTL_SHIFT)
#  define SCT_STARTL(n)             (1 << (n))
#define SCT_STARTH_SHIFT            (16)      /* Bits 16-31: Clear STOPL in CTRL register */
#define SCT_STARTH_MASK             (0xffff << SCT_STARTH_SHIFT)
#  define SCT_STARTH(n)             (1 << (SCT_STARTH_SHIFT+(n)))

/* SCT start condition register low 16-bit (all 16-bits for start condition) */

#define SCT_START(n)                (1 << (n))

/* SCT counter register (all 32-bits for unified counter) */

#define SCT_COUNTL_SHIFT            (0)       /* Bits 0-15: L counter value */
#define SCT_COUNTL_MASK             (0xffff << SCT_COUNTL_SHIFT)
#define SCT_COUNTH_SHIFT            (16)      /* Bits 16-31: H counter value */
#define SCT_COUNTH_MASK             (0xffff << SCT_COUNTH_SHIFT)

/* SCT counter register low/high 16-bit (all 16-bits for counter value)*/

/* SCT state register */

#define SCT_STATEU_SHIFT            (0)       /* Bits 0-5: Unified counter state */
#define SCT_STATEU_MASK             (31 << SCT_STATEL_SHIFT)
#define SCT_STATEL_SHIFT            (0)       /* Bits 0-5: L counter state */
#define SCT_STATEL_MASK             (31 << SCT_STATEL_SHIFT)
                                              /* Bits 6-15: Reserved */
#define SCT_STATEH_SHIFT            (16)      /* Bits 16-20: H counter state */
#define SCT_STATEH_MASK             (31 << SCT_STATEH_SHIFT)
                                              /* Bits 21-31: Reserved */
/* SCT state register low/high 16-bit */

#define SCT_STATE_SHIFT             (0)       /* Bits 0-5: Counter state */
#define SCT_STATE_MASK              (31 << SCT_STATE_SHIFT)
                                              /* Bits 6-15: Reserved */
/* SCT input register */

#define SCT_INPUT_AIN(n)            (1 << (n))
#define SCT_INPUT_AIN0              (1 << 0)  /* Bit 0:  Real-time status of input 0 */
#define SCT_INPUT_AIN1              (1 << 1)  /* Bit 1:  Real-time status of input 1 */
#define SCT_INPUT_AIN2              (1 << 2)  /* Bit 2:  Real-time status of input 2 */
#define SCT_INPUT_AIN3              (1 << 3)  /* Bit 3:  Real-time status of input 3 */
#define SCT_INPUT_AIN4              (1 << 4)  /* Bit 4:  Real-time status of input 4 */
#define SCT_INPUT_AIN5              (1 << 5)  /* Bit 5:  Real-time status of input 5 */
#define SCT_INPUT_AIN6              (1 << 6)  /* Bit 6:  Real-time status of input 6 */
#define SCT_INPUT_AIN7              (1 << 7)  /* Bit 7:  Real-time status of input 7 */
                                              /* Bits 8-15: Reserved */
#define SCT_INPUT_SIN(n)            (1 << ((n)+16))
#define SCT_INPUT_SIN0              (1 << 16) /* Bit 16: Synchronized input 0 state */
#define SCT_INPUT_SIN1              (1 << 17) /* Bit 17: Synchronized input 1 state */
#define SCT_INPUT_SIN2              (1 << 18) /* Bit 18: Synchronized input 2 state */
#define SCT_INPUT_SIN3              (1 << 19) /* Bit 19: Synchronized input 3 state */
#define SCT_INPUT_SIN4              (1 << 20) /* Bit 20: Synchronized input 4 state */
#define SCT_INPUT_SIN5              (1 << 21) /* Bit 21: Synchronized input 5 state */
#define SCT_INPUT_SIN6              (1 << 22) /* Bit 22: Synchronized input 6 state */
#define SCT_INPUT_SIN7              (1 << 23) /* Bit 23: Synchronized input 7 state */
                                              /* Bits 24-31: Reserved */
/* SCT match/capture registers mode register (all 32-bits for unified counter)*/

#define SCT_REGMU(n)                (1 << (n))
#define SCT_REGML_SHIFT             (0)       /* Bits 0-15: Match/capture registers n */
#define SCT_REGML_MASK              (0xffff << SCT_REGML_SHIFT)
#  define SCT_REGML(n)              (1 << (n))
#define SCT_REGMH_SHIFT             (16)      /* Bits 16-31: Match/capture registers n */
#define SCT_REGMH_MASK              (0xffff << SCT_REGMH_SHIFT)
#  define SCT_REGMH(n)              (1 << (SCT_REGMH_SHIFT+(n)))

/* SCT match/capture registers mode register low 16-bit (all 16-bits)*/

#define SCT_REGM(n)                 (1 << (n))

/* SCT output register */

