PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sct.h
#define SCT_OUTU(n)                 (1 << (n)) /* Bits 0-15: Set output n */

/* SCT output counter direction control register */

#define SCT_OUTDIRC_UNCOND          (0)        /* Set and clear do not depend on any counter */
#define SCT_OUTDIRC_REVU            (1)        /* Reversed when unified counter is counting down */
#define SCT_OUTDIRC_REVL            (1)        /* Reversed when L counter is counting down */
#define SCT_OUTDIRC_REVH            (2)        /* Reversed when H counter is counting down */

#define SCT_OUTDIRC_SETCLR_SHIFT(c) ((c) << 1)
#define SCT_OUTDIRC_SETCLR_SHIFT(c) (3 << SCT_OUTDIRC_SETCLR_SHIFT(c))
#  define SCT_OUTDIRC_SETCLR(c,n)   ((n) << SCT_OUTDIRC_SETCLR_SHIFT(c))

#define SCT_OUTDIRC_SETCLR0_SHIFT   (0)       /* Bits 0-1: Set/clear operation on output 0 */
#define SCT_OUTDIRC_SETCLR0_MASK    (3 << SCT_OUTDIRC_SETCLR0_SHIFT)
#  define SCT_OUTDIRC_SETCLR0(n)    ((n) << SCT_OUTDIRC_SETCLR0_SHIFT)
#define SCT_OUTDIRC_SETCLR1_SHIFT   (2)       /* Bits 2-3: Set/clear operation on output 1 */
#define SCT_OUTDIRC_SETCLR1_MASK    (3 << SCT_OUTDIRC_SETCLR1_SHIFT)
#  define SCT_OUTDIRC_SETCLR1(n)    ((n) << SCT_OUTDIRC_SETCLR1_SHIFT)
#define SCT_OUTDIRC_SETCLR2_SHIFT   (4)       /* Bits 4-5: Set/clear operation on output 2 */
#define SCT_OUTDIRC_SETCLR2_MASK    (3 << SCT_OUTDIRC_SETCLR2_SHIFT)
#  define SCT_OUTDIRC_SETCLR2(n)    ((n) << SCT_OUTDIRC_SETCLR2_SHIFT)
#define SCT_OUTDIRC_SETCLR3_SHIFT   (6)       /* Bits 6-7: Set/clear operation on output 3 */
#define SCT_OUTDIRC_SETCLR3_MASK    (3 << SCT_OUTDIRC_SETCLR3_SHIFT)
#  define SCT_OUTDIRC_SETCLR3(n)    ((n) << SCT_OUTDIRC_SETCLR3_SHIFT)
#define SCT_OUTDIRC_SETCLR4_SHIFT   (8)       /* Bits 8-9: Set/clear operation on output 4 */
#define SCT_OUTDIRC_SETCLR4_MASK    (3 << SCT_OUTDIRC_SETCLR4_SHIFT)
#  define SCT_OUTDIRC_SETCLR4(n)    ((n) << SCT_OUTDIRC_SETCLR4_SHIFT)
#define SCT_OUTDIRC_SETCLR5_SHIFT   (10)       /* Bits 10-11: Set/clear operation on output 5 */
#define SCT_OUTDIRC_SETCLR5_MASK    (3 << SCT_OUTDIRC_SETCLR5_SHIFT)
#  define SCT_OUTDIRC_SETCLR5(n)    ((n) << SCT_OUTDIRC_SETCLR5_SHIFT)
#define SCT_OUTDIRC_SETCLR6_SHIFT   (12)       /* Bits 12-13: Set/clear operation on output 6 */
#define SCT_OUTDIRC_SETCLR6_MASK    (3 << SCT_OUTDIRC_SETCLR6_SHIFT)
#  define SCT_OUTDIRC_SETCLR6(n)    ((n) << SCT_OUTDIRC_SETCLR6_SHIFT)
#define SCT_OUTDIRC_SETCLR7_SHIFT   (14)       /* Bits 14-15: Set/clear operation on output 7 */
#define SCT_OUTDIRC_SETCLR7_MASK    (3 << SCT_OUTDIRC_SETCLR7_SHIFT)
#  define SCT_OUTDIRC_SETCLR7(n)    ((n) << SCT_OUTDIRC_SETCLR7_SHIFT)
#define SCT_OUTDIRC_SETCLR8_SHIFT   (16)       /* Bits 16-17: Set/clear operation on output 8 */
#define SCT_OUTDIRC_SETCLR8_MASK    (3 << SCT_OUTDIRC_SETCLR8_SHIFT)
#  define SCT_OUTDIRC_SETCLR8(n)    ((n) << SCT_OUTDIRC_SETCLR8_SHIFT)
#define SCT_OUTDIRC_SETCLR9_SHIFT   (18)       /* Bits 18-19: Set/clear operation on output 9 */
#define SCT_OUTDIRC_SETCLR9_MASK    (3 << SCT_OUTDIRC_SETCLR9_SHIFT)
#  define SCT_OUTDIRC_SETCLR9(n)    ((n) << SCT_OUTDIRC_SETCLR9_SHIFT)
#define SCT_OUTDIRC_SETCLR10_SHIFT  (20)       /* Bits 20-21: Set/clear operation on output 10 */
#define SCT_OUTDIRC_SETCLR10_MASK   (3 << SCT_OUTDIRC_SETCLR10_SHIFT)
#  define SCT_OUTDIRC_SETCLR10(n)   ((n) << SCT_OUTDIRC_SETCLR10_SHIFT)
#define SCT_OUTDIRC_SETCLR11_SHIFT  (22)       /* Bits 22-23: Set/clear operation on output 11 */
#define SCT_OUTDIRC_SETCLR11_MASK   (3 << SCT_OUTDIRC_SETCLR11_SHIFT)
#  define SCT_OUTDIRC_SETCLR11(n)   ((n) << SCT_OUTDIRC_SETCLR11_SHIFT)
#define SCT_OUTDIRC_SETCLR12_SHIFT  (24)       /* Bits 24-25: Set/clear operation on output 12 */
#define SCT_OUTDIRC_SETCLR12_MASK   (3 << SCT_OUTDIRC_SETCLR12_SHIFT)
#  define SCT_OUTDIRC_SETCLR12(n)   ((n) << SCT_OUTDIRC_SETCLR12_SHIFT)
#define SCT_OUTDIRC_SETCLR13_SHIFT  (26)       /* Bits 26-27: Set/clear operation on output 13 */
#define SCT_OUTDIRC_SETCLR13_MASK   (3 << SCT_OUTDIRC_SETCLR13_SHIFT)
#  define SCT_OUTDIRC_SETCLR13(n)   ((n) << SCT_OUTDIRC_SETCLR13_SHIFT)
#define SCT_OUTDIRC_SETCLR14_SHIFT  (28)       /* Bits 28-29: Set/clear operation on output 14 */
#define SCT_OUTDIRC_SETCLR14_MASK   (3 << SCT_OUTDIRC_SETCLR14_SHIFT)
#  define SCT_OUTDIRC_SETCLR14(n)   ((n) << SCT_OUTDIRC_SETCLR14_SHIFT)
#define SCT_OUTDIRC_SETCLR15_SHIFT  (30)       /* Bits 30-31: Set/clear operation on output 15 */
#define SCT_OUTDIRC_SETCLR15_MASK   (3 << SCT_OUTDIRC_SETCLR15_SHIFT)
#  define SCT_OUTDIRC_SETCLR15(n)   ((n) << SCT_OUTDIRC_SETCLR15_SHIFT)

/* SCT conflict resolution register */

#define SCT_RES_NOCHANGE            (0)        /* No change */
#define SCT_RES_SET                 (1)        /* Set output */
#define SCT_RES_CLEAR               (1)        /* Clear output */
#define SCT_RES_TOGGLE              (2)        /* Toggle output */

#define SCT_RES_OUT_SHIFT(c)        ((c) << 1)
#define SCT_RES_OUT_SHIFT(c)        (3 << SCT_RES_OUT_SHIFT(c))
#  define SCT_RES_OUT(c,n)          ((n) << SCT_RES_OUT_SHIFT(c))

#define SCT_RES_OUT0_SHIFT          (0)       /* Bits 0-1: Effect of simultaneous set and clear on output 0 */
#define SCT_RES_OUT0_MASK           (3 << SCT_RES_OUT0_SHIFT)
#  define SCT_RES_OUT0(n)           ((n) << SCT_RES_OUT0_SHIFT)
#define SCT_RES_OUT1_SHIFT          (2)       /* Bits 2-3: Effect of simultaneous set and clear on output 1 */
#define SCT_RES_OUT1_MASK           (3 << SCT_RES_OUT1_SHIFT)
#  define SCT_RES_OUT1(n)           ((n) << SCT_RES_OUT1_SHIFT)
#define SCT_RES_OUT2_SHIFT          (4)       /* Bits 4-5: Effect of simultaneous set and clear on output 2 */
#define SCT_RES_OUT2_MASK           (3 << SCT_RES_OUT2_SHIFT)
#  define SCT_RES_OUT2(n)           ((n) << SCT_RES_OUT2_SHIFT)
#define SCT_RES_OUT3_SHIFT          (6)       /* Bits 6-7: Effect of simultaneous set and clear on output 3 */
#define SCT_RES_OUT3_MASK           (3 << SCT_RES_OUT3_SHIFT)
#  define SCT_RES_OUT3(n)           ((n) << SCT_RES_OUT3_SHIFT)
#define SCT_RES_OUT4_SHIFT          (8)       /* Bits 8-9: Effect of simultaneous set and clear on output 4 */
#define SCT_RES_OUT4_MASK           (3 << SCT_RES_OUT4_SHIFT)
#  define SCT_RES_OUT4(n)           ((n) << SCT_RES_OUT4_SHIFT)
#define SCT_RES_OUT5_SHIFT          (10)       /* Bits 10-11: Effect of simultaneous set and clear on output 5 */
#define SCT_RES_OUT5_MASK           (3 << SCT_RES_OUT5_SHIFT)
#  define SCT_RES_OUT5(n)           ((n) << SCT_RES_OUT5_SHIFT)
#define SCT_RES_OUT6_SHIFT          (12)       /* Bits 12-13: Effect of simultaneous set and clear on output 6 */
#define SCT_RES_OUT6_MASK           (3 << SCT_RES_OUT6_SHIFT)
#  define SCT_RES_OUT6(n)           ((n) << SCT_RES_OUT6_SHIFT)
#define SCT_RES_OUT7_SHIFT          (14)       /* Bits 14-15: Effect of simultaneous set and clear on output 7 */
#define SCT_RES_OUT7_MASK           (3 << SCT_RES_OUT7_SHIFT)
#  define SCT_RES_OUT7(n)           ((n) << SCT_RES_OUT7_SHIFT)
#define SCT_RES_OUT8_SHIFT          (16)       /* Bits 16-17: Effect of simultaneous set and clear on output 8 */
#define SCT_RES_OUT8_MASK           (3 << SCT_RES_OUT8_SHIFT)
#  define SCT_RES_OUT8(n)           ((n) << SCT_RES_OUT8_SHIFT)
#define SCT_RES_OUT9_SHIFT          (18)       /* Bits 18-19: Effect of simultaneous set and clear on output 9 */
#define SCT_RES_OUT9_MASK           (3 << SCT_RES_OUT9_SHIFT)
#  define SCT_RES_OUT9(n)           ((n) << SCT_RES_OUT9_SHIFT)
#define SCT_RES_OUT10_SHIFT         (20)       /* Bits 20-21: Effect of simultaneous set and clear on output 10 */
#define SCT_RES_OUT10_MASK          (3 << SCT_RES_OUT10_SHIFT)
#  define SCT_RES_OUT10(n)          ((n) << SCT_RES_OUT10_SHIFT)
#define SCT_RES_OUT11_SHIFT         (22)       /* Bits 22-23: Effect of simultaneous set and clear on output 11 */
#define SCT_RES_OUT11_MASK          (3 << SCT_RES_OUT11_SHIFT)
#  define SCT_RES_OUT11(n)          ((n) << SCT_RES_OUT11_SHIFT)
#define SCT_RES_OUT12_SHIFT         (24)       /* Bits 24-25: Effect of simultaneous set and clear on output 12 */
#define SCT_RES_OUT12_MASK          (3 << SCT_RES_OUT12_SHIFT)
#  define SCT_RES_OUT12(n)          ((n) << SCT_RES_OUT12_SHIFT)
#define SCT_RES_OUT13_SHIFT         (26)       /* Bits 26-27: Effect of simultaneous set and clear on output 13 */
#define SCT_RES_OUT13_MASK          (3 << SCT_RES_OUT13_SHIFT)
#  define SCT_RES_OUT13(n)          ((n) << SCT_RES_OUT13_SHIFT)
#define SCT_RES_OUT14_SHIFT         (28)       /* Bits 28-29: Effect of simultaneous set and clear on output 14 */
#define SCT_RES_OUT14_MASK          (3 << SCT_RES_OUT14_SHIFT)
#  define SCT_RES_OUT14(n)          ((n) << SCT_RES_OUT14_SHIFT)
#define SCT_RES_OUT15_SHIFT         (30)       /* Bits 30-31: Effect of simultaneous set and clear on output 15 */
#define SCT_RES_OUT15_MASK          (3 << SCT_RES_OUT15_SHIFT)
#  define SCT_RES_OUT15(n)          ((n) << SCT_RES_OUT15_SHIFT)

/* SCT DMA request 0/1 registers */

#define SCT_DMAREQ_DEV_SHIFT        (0)       /* Bits 0-15:  Event n sets DMA request */
#define SCT_DMAREQ_DEV_MASK         (0xffff << SCT_DMAREQ_DEV_SHIFT)
#  define SCT_DMAREQ_DEV(n)         (1 << ((n) + SCT_DMAREQ_DEV_SHIFT))
                                              /* Bits 16-29: Reserved */
#define SCT_DMAREQ_DRL              (1 << 30) /* Bit 30: DMA request when counter reloaded */
#define SCT_DMAREQ_DRQ              (1 << 31) /* Bit 31: State of DMA Request */

/* SCT event enable register */

