PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sct.h
#define SCT_EVEN_SHIFT              (0)       /* Bits 0-15:  Enable event n interrupts */
#define SCT_EVEN_MASK               (0xffff << SCT_EVEN_SHIFT)
#  define SCT_EVEN(n)               (1 << ((n) + SCT_EVEN_SHIFT))
                                              /* Bits 1-31: Reserved */
/* SCT event flag register */

#define SCT_EVFLAG_SHIFT            (0)       /* Bits 0-15:  Event n status */
#define SCT_EVFLAG_MASK             (0xffff << SCT_EVFLAG_SHIFT)
#  define SCT_EVFLAG(n)             (1 << ((n) + SCT_EVFLAG_SHIFT))
                                              /* Bits 1-31: Reserved */
/* SCT conflict enable register */

#define SCT_CONEN_SHIFT             (0)       /* Bits 0-15:  Event n conflict interrupts */
#define SCT_CONEN_MASK              (0xffff << SCT_CONEN_SHIFT)
#  define SCT_CONEN(n)              (1 << ((n) + SCT_CONEN_SHIFT))
                                              /* Bits 1-31: Reserved */
/* SCT conflict flag register */

#define SCT_CONFLAG_DEV_SHIFT       (0)       /* Bits 0-15:  No-change conflict on output n */
#define SCT_CONFLAG_DEV_MASK        (0xffff << SCT_CONFLAG_DEV_SHIFT)
#  define SCT_CONFLAG_DEV(n)        (1 << ((n) + SCT_CONFLAG_DEV_SHIFT))
                                              /* Bits 16-29: Reserved */
#define SCT_CONFLAG_BUSERRU         (1 << 30) /* Bit 30: Unified counter bus error */
#define SCT_CONFLAG_BUSERRL         (1 << 30) /* Bit 30: L counter bus error bus error */
#define SCT_CONFLAG_BUSERRH         (1 << 31) /* Bit 31: H counter bus error bus error */

/* SCT match value register of match channels 0-15 (all 32-bits for unified counter) */
/* SCT match alias register of match channels 0-15 (all 32-bits for unified counter) */

#define SCT_MATCHL_SHIFT            (0)       /* Bits 0-15: L match value */
#define SCT_MATCHL_MASK             (0xffff << SCT_MATCHL_SHIFT)
#define SCT_MATCHH_SHIFT            (16)      /* Bits 16-31: H match value */
#define SCT_MATCHH_MASK             (0xffff << SCT_MATCHH_SHIFT)

/* SCT high/low match value register of match channels 0-15 */
/* SCT high/low match alias register of match channels 0-15 */

#define SCT_MATCH_SHIFT             (0)       /* Bits 0-15: match value */
#define SCT_MATCH_MASK              (0xffff << SCT_MATCH_SHIFT))

/* SCT match reload register of match channels 0-15 (all 32-bits for unified counter) */
/* SCT match reload alias register of match channels 0-15 (all 32-bits for unified counter) */

#define SCT_RELOADL_SHIFT           (0)       /* Bits 0-15: L reload value */
#define SCT_RELOADL_MASK            (0xffff << SCT_RELOADL_SHIFT)
#define SCT_RELOADH_SHIFT           (16)      /* Bits 16-31: H reload value */
#define SCT_RELOADH_MASK            (0xffff << SCT_RELOADH_SHIFT)

/* SCT high/low match reload register of match channels 0-15 */
/* SCT high/low match reload alias register of match channels 0-15 */

#define SCT_RELOAD_SHIFT            (0)       /* Bits 0-15: Reload value */
#define SCT_RELOAD_MASK             (0xffff << SCT_RELOAD_SHIFT)

/* SCT capture value register of capture channels 0-15 (all 32-bits for unified counter) */
/* SCT capture alias register of capture channels 0-15 (all 32-bits for unified counter) */

#define SCT_CAPL_SHIFT              (0)       /* Bits 0-15: L capture value */
#define SCT_CAPL_MASK               (0xffff << SCT_CAPL_SHIFT)
#define SCT_CAPH_SHIFT              (16)      /* Bits 16-31: H capture value */
#define SCT_CAPH_MASK               (0xffff << SCT_CAPH_SHIFT)

/* SCT high/low capture value register of capture channels 0-15 */
/* SCT high/low capture alias register of capture channels 0-15 */

#define SCT_CAP_SHIFT               (0)       /* Bits 0-15: Capture value */
#define SCT_CAP_MASK                (0xffff << SCT_CAP_SHIFT)

/* SCT capture control register of capture channels 0-15 (all 32-bits for unified counter) */
/* SCT capture control alias register of capture channels 0-15 (all 32-bits for unified counter) */

#define SCT_CAPCONU(n)              (1 << (n))
#define SCT_CAPCONL_SHIFT           (0)       /* Bits 0-15: L capture controls */
#define SCT_CAPCONL_MASK            (0xffff << SCT_CAPCONL_SHIFT)
#  define SCT_CAPCONL(n)            (1 << ((n)+SCT_CAPCONL_SHIFT))
#define SCT_CAPCONH_SHIFT           (16)      /* Bits 16-31: H capture controls */
#define SCT_CAPCONH_MASK            (0xffff << SCT_CAPCONH_SHIFT)
#  define SCT_CAPCONH(n)            (1 << ((n)+SCT_CAPCONH_SHIFT))

/* SCT high/low capture control register of capture channels 0-15 */
/* SCT high/low capture control alias register of capture channels 0-15 */

#define SCT_CAPCON_SHIFT            (0)       /* Bits 0-15: Capture controls */
#define SCT_CAPCON_MASK             (0xffff << SCT_CAPCON_SHIFT)
#  define SCT_CAPCON(n)             (1 << ((n)+SCT_CAPCON_SHIFT))

/* SCT event state mask registers 0 to 15 */

#define SCT_EVSM(n)                 (1 << (n))

/* SCT event control registers 0 to 15 */

#define SCT_EVC_MATCHSEL_SHIFT      (0)       /* Bits 0-3: Selects Match register associated event */
#define SCT_EVC_MATCHSEL_MASK       (15 << SCT_EVC_MATCHSEL_SHIFT)
#define SCT_EVC_HEVENT              (1 << 4)  /* Bit 4:  Select L/H counter */
#define SCT_EVC_OUTSEL              (1 << 5)  /* Bit 5:  Input/output select*/
#define SCT_EVC_IOSEL_SHIFT         (6)       /* Bits 6-9: Selects input or output signal associated event */
#define SCT_EVC_IOSEL_MASK          (15 << SCT_EVC_IOSEL_SHIFT)
#define SCT_EVC_IOCOND_SHIFT        (10)      /* Bits 10-11: Selects I/O condition for event n */
#define SCT_EVC_IOCOND_MASK         (3 << SCT_EVC_IOCOND_SHIFT)
#  define SCT_EVC_IOCOND_LOW        (0 << SCT_EVC_IOCOND_SHIFT)
#  define SCT_EVC_IOCOND_RISE       (1 << SCT_EVC_IOCOND_SHIFT)
#  define SCT_EVC_IOCOND_FALL       (2 << SCT_EVC_IOCOND_SHIFT)
#  define SCT_EVC_IOCOND_HIGH       (3 << SCT_EVC_IOCOND_SHIFT)
#define SCT_EVC_COMBMODE_SHIFT      (12)      /* Bits 12-13: Match and I/O condition usage */
#define SCT_EVC_COMBMODE_MASK       (3 << SCT_EVC_COMBMODE_SHIFT)
#  define SCT_EVC_COMBMODE_OR       (0 << SCT_EVC_COMBMODE_SHIFT)
#  define SCT_EVC_COMBMODE_MATCH    (1 << SCT_EVC_COMBMODE_SHIFT)
#  define SCT_EVC_COMBMODE_IO       (2 << SCT_EVC_COMBMODE_SHIFT)
#  define SCT_EVC_COMBMODE_AND      (3 << SCT_EVC_COMBMODE_SHIFT)
#define SCT_EVC_STATELD             (1 << 14)  /* Bit 14:  STATEV control */
#define SCT_EVC_STATEV_SHIFT        (15)       /* Bits 15-19: State value */
#define SCT_EVC_STATEV_MASK         (31 << SCT_EVC_STATEV_SHIFT)
                                               /* Bits 20-31: Reserved */
/* SCT output set registers 0 to 15 */

#define SCT_OUTSET_SHIFT            (0)        /* Bits 0-15: Bit m selects event m to set output n */
#define SCT_OUTSET_MASK             (0xffff << SCT_OUTSET_SHIFT)
#  define SCT_OUTSET_MASK(m)        (1 << ((n)SCT_OUTSET_SHIFT))
                                               /* Bits 16-31: Reserved */
/* SCT output clear registers 0 to 15 */

#define SCT_OUTCLR_SHIFT            (0)        /* Bits 0-15: Bit m selects event m to clear output n */
#define SCT_OUTCLR_MASK             (0xffff << SCT_OUTCLR_SHIFT)
#  define SCT_OUTCLR_MASK(m)        (1 << ((n)SCT_OUTCLR_SHIFT))
                                               /* Bits 16-31: Reserved */

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_SCT_H */
